[
  {
    "part_number": 1,
    "chapter": [1, 10],
    "part_name": "雏龙出渊",
    "part_summary": "濒死的帝国缔造者林栋重生2008年旧金山，携前世记忆与父亲资本，以Airbnb天使轮为起点激活“推手人生系统”，用50万美元拿下20%股份并锁定后续融资权；同时布局湾流G550、收服苏雨晴、伊琳娜等核心女伴，建立早期资本与人脉雏形，完成重生者身份落地。"
  },
  {
    "part_number": 2,
    "chapter": [11, 30],
    "part_name": "迈阿密风暴",
    "part_summary": "林栋借豪华晚宴打入美航与上流圈层，用3000万美元敲定私人飞机并埋下航空资产伏笔；随后转战迈阿密，以海军少将威廉·斯塔克为后盾营救丽娜，顺势收割杰克1000万美金赔偿并建立G4S安保线。返新加坡后，48小时内闪电组建单一家办，收编李思雨、赵晨曦、王雅丽等顶级人才，完成家族办公室与资本中枢的跨国奠基。"
  },
  {
    "part_number": 3,
    "chapter": [31, 50],
    "part_name": "东瀛暗战",
    "part_summary": "在新加坡完成恒信家办收购与5.2亿美元信托架构后，林栋亲赴日本，以1.4亿新元鲸吞牌照并布局忍者军团；借暗网悬赏拖住前世宿敌樱井健一郎，再以5000万美元复仇基金保护伊琳娜，双线引爆地下势力对决。最终收编御池岳女忍村落，建立第一支绝对忠诚的私人武装，为后续全球渗透埋下暗线。"
  },
  {
    "part_number": 4,
    "chapter": [51, 70],
    "part_name": "京华风云",
    "part_summary": "春节回国，林栋以先知优势阻止父亲为谷新龙担保，斩断前世家族巨亏根源；携苏雨晴、丽娜拜会家族，确立“投资天才”地位。随后以50亿中药材项目锁定杭城政府与江书记背书，并借铜首拍卖设局皮诺家族，零成本回收鼠首兔首并高调捐赠国家，完成爱国青年企业家形象塑造，为政治护身符加码。"
  },
  {
    "part_number": 5,
    "chapter": [71, 90],
    "part_name": "北美再临",
    "part_summary": "返美后，林栋以红杉50亿美元大单锁定LP席位，并借麦道夫爆雷前夕与犹太资本对赌纳斯达克，转入瑞贝卡信托隐身幕后。随后改修物理，抛出百亿美金质子对撞机计划，挖角欧美顶尖人才；在UCLA高调撒钱2000万美元收买全校人心，为科技-资本-校园三线扩张奠定舆论与人才基础。"
  },
  {
    "part_number": 6,
    "chapter": [91, 110],
    "part_name": "漫威铜首",
    "part_summary": "林栋以《十二生肖》电影为幌子，用3D打印赝品在巴黎佳士得调包真铜首，2400万欧元买回假货后当众焚毁，零成本拿下国宝并引爆舆论；回国捐赠奠定爱国形象，顺势在北大演讲抛出共享经济版权战略，完成从幕后资本到青年领袖的公众转型，并为杭城项目赢得顶级政商背书。"
  },
  {
    "part_number": 7,
    "chapter": [111, 130],
    "part_name": "外骨骼崛起",
    "part_summary": "林栋以49亿美元砸出“悟空”外骨骼，校园首秀救人爆红后拒绝贝索斯投资，携迪士尼共建科技乐园；随后用石墨烯电池+冷核聚变迭代马克3号战甲，在舟山LHC落成之际完成钢铁侠式首飞，确立个人科技霸权。同时以氢能源悍马、海岸星光列车覆盖海陆空交通版图，把氢能-外骨骼-核聚变三线推向全球风口。"
  },
  {
    "part_number": 8,
    "chapter": [131, 150],
    "part_name": "马尔代夫后宫",
    "part_summary": "携25位伴侣包岛马尔代夫，林栋以7200万美元超级游艇+悟空装甲+49人安保打造海上帝国；深海探险发现古代遗迹与外星符号，顺势确立“后宫共主”秩序。通过年度结算手握580属性点与48亿美元，为下一步南极行动与未知强敌做终极武装。"
  },
  {
    "part_number": 9,
    "chapter": [151, 170],
    "part_name": "极地远征",
    "part_summary": "林栋率极地远征队潜入南极2150米冰盖，摧毁蜥蜴人能量收割塔并直面纯血领袖特拉克斯；以100属性点破限晋升“生物力场”新人类，夺得记录反抗派系坐标的乳白晶体。暴风雪围杀中分兵突围，为人类首次与外星造物主对决抢到唯一生机，也为北极更大危机埋下倒计时。"
  },
  {
    "part_number": 10,
    "chapter": [171, 190],
    "part_name": "婚姻与暗线",
    "part_summary": "回国订婚，林栋以赤霄剑与圆明园国宝赢得胡家与最高层认可，当天领证完成政治联姻；随后密会皇甫静布局“煤气罐大炮”反制美军外骨骼，并以舟山LHC主权升旗立威。再赴罗斯柴尔德公海堡垒，用基因修复液收编乔纳森与艾米莉亚，建立第一条顶级世家仆从链。"
  },
  {
    "part_number": 11,
    "chapter": [191, 210],
    "part_name": "全球清洗",
    "part_summary": "林栋借泰坦系统锁定吹牛老爹跨国犯罪网，一夜全球扫黑斩断十年布局；随后在摩洛哥遭贩毒集团伏击，反杀后得国王背书，将外骨骼技术推上国际反恐舞台。回国后于迪士尼夜空公开钢铁装甲求婚，正式宣告个人科技帝国与后宫的双重加冕。"
  },
  {
    "part_number": 12,
    "chapter": [211, 230],
    "part_name": "核聚变与基因永生",
    "part_summary": "林栋兑换冷核聚变方案并微缩至胸甲反应堆，完成马克战甲超音速首飞；随后以5000万美元一剂售卖基因优化液，收割全球财阀忠诚。与埃莉诺共建马来西亚秘密海岛基地，启动自体干细胞临床与氢燃料电池整车落地，奠定医疗-能源-军工三大霸权基石。"
  },
  {
    "part_number": 13,
    "chapter": [231, 248],
    "part_name": "蜥蜴人真相",
    "part_summary": "量子卫星捕获高维信号，林栋追踪至南极发现12万年前蜥蜴人基地，确认人类被设计为情绪电池；以精神对抗击伤守护者阿瑞厄斯，夺得原初者飞船坐标。撤离途中基地自毁，暴风雪与深渊截断退路，北极更大收割倒计时启动，人类与外星造物主的全面战争一触即发。"
  }
]